; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	infrared2 - mode
	GroundStation6 - direction
	GroundStation8 - direction
	Star5 - direction
	Star4 - direction
	GroundStation0 - direction
	Star1 - direction
	Star7 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star9)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
	(supports instrument3 spectrograph1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star5)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
	(supports instrument6 infrared2)
	(supports instrument6 spectrograph0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 Star9)
	(supports instrument7 spectrograph1)
	(supports instrument7 spectrograph0)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star9)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet10)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 Star7)
	(calibration_target instrument8 Star9)
	(supports instrument9 spectrograph1)
	(supports instrument9 spectrograph0)
	(supports instrument9 infrared2)
	(calibration_target instrument9 Star9)
	(calibration_target instrument9 GroundStation3)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation6)
)
(:goal (and
	(pointing satellite2 GroundStation8)
	(pointing satellite4 Planet14)
	(have_image Planet10 spectrograph1)
	(have_image Planet11 spectrograph1)
	(have_image Phenomenon12 spectrograph0)
	(have_image Planet13 spectrograph0)
	(have_image Planet14 spectrograph1)
	(have_image Star15 spectrograph0)
))

)

; plan
1. (turn_to satellite4 planet14 groundstation6)
   deleted: (pointing satellite4 groundstation6)
   added: (pointing satellite4 planet14)
   goals met: 1 of 8
2. (turn_to satellite2 groundstation8 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 groundstation8)
   goals met: 2 of 8
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 8
4. (calibrate satellite1 instrument3 groundstation6)
   added: (calibrated instrument3)
   goals met: 2 of 8
5. (turn_to satellite1 planet11 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet11)
   goals met: 2 of 8
6. (take_image satellite1 planet11 instrument3 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 3 of 8
7. (turn_to satellite1 planet10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet10)
   goals met: 3 of 8
8. (take_image satellite1 planet10 instrument3 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 4 of 8
9. (turn_to satellite1 phenomenon12 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon12)
   goals met: 4 of 8
10. (take_image satellite1 phenomenon12 instrument3 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 5 of 8
11. (turn_to satellite1 planet13 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet13)
   goals met: 5 of 8
12. (take_image satellite1 planet13 instrument3 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 6 of 8
13. (turn_to satellite1 planet14 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet14)
   goals met: 6 of 8
14. (take_image satellite1 planet14 instrument3 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 7 of 8
15. (turn_to satellite1 star15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star15)
   goals met: 7 of 8
16. (take_image satellite1 star15 instrument3 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 8 of 8
